Repository: CIOIL/GovShare
Catalog: govil_og_notify/govil_og_notify.*.po
Languages: he

source: Configure notifications for
he: הגדר התראות ל

source: Manage Notifications
he: ניהול התראות

source: Manage notifications in group.
he: .ניהול התראות על עידכוני תוכן בקבוצה

source: Group
he: קבוצה

source: Users
he: משתמשים

source: All members in the group
he: כל חברי הקבוצה

source: You
he: את/ה

source: Do you want to change setting for you or for all members?
he: האם את/ה משנה הגדרות לך או לכל חברי קבוצתך?

source: Set the content types you want to send.
he: בחר/י את סוגי התוכן שעליהם את/ה מעוניין/ת לקבל התראות.

source: Frequency
he: תדירות

source: Monthly
he: חודשי

source: What is the frequency you want?
he: באיזו תדירות תרצה/י לקבל התראות?

source: New
he: חדש

source: Do you want to get notification about new or updated content?
he: האם תרצה/י לקבל התראה על תוכן חדש או על תוכן שעודכן?

source: Your configuration has been saved.
he: ההגדרות נשמרו בהצלחה.

source: has been created
he: נוצר

source: has been updated
he: עודכן

source: Updates for you
he: עידכונים בשבילך

source: Notifications about new content
he: התראות על תוכן חדש או מעודכן
